[
  {
    "title": "Brown University to lead national institute focused on intuitive, trustworthy AI assistants",
    "link": "https://www.brown.edu/news/2025-07-29/aria-ai-institute-brown",
    "blurb": "Brown University will lead a $20 million National Science Foundation-funded AI research institute aimed at developing AI assistants capable of trustworthy, sensitive and context-aware interactions with people, with potential applications in mental and behavioral health. The ARIA institute includes Thomas Serre as associate director.",
    "image": "https://www.brown.edu/sites/default/files/styles/portrait_full_med/public/quote/20250722_COMM_AIResearch002%20copy.jpg"
  },
  {
    "title": "Inside ClickMe: Professor Thomas Serre and Jay Gopal on advancing explainable AI",
    "link": "https://americanbazaaronline.com/2025/02/19/clickme-professor-thomas-serre-and-jay-gopal-on-advancing-explainable-ai-459719/",
    "blurb": "Professor Thomas Serre and student Jay Gopal discuss the inspiration and challenges behind ClickMe, an explainable AI initiative building human-aligned vision models from the Serre Lab. The online game collects psychophysics data to understand where humans think is important in an image.",
    "image": "https://americanbazaaronline.com/wp-content/uploads/2025/02/photo-output-3.jpg"
  },
  {
    "title": "Brown University offers cash incentive to assist with 'Click Me' AI research",
    "link": "https://turnto10.com/news/local/brown-university-offers-cash-incentive-to-assist-with-click-me-ai-research-artificial-intelligence-deep-learning-lab-plme-brain-science-game-vision-february-24-2025",
    "blurb": "A Brown University department is paying people to participate in an online game that helps train artificial intelligence. The Serre Lab has already given out more than $10,000 to game participants thanks to National Science Foundation funding.",
    "image": "https://turnto10.com/resources/media2/16x9/1920/986/center/90/48cfa15b-64cf-481c-bdd1-8366385e822b-6PPKG.transfer_frame_122.jpeg"
  },
  {
    "title": "Explainable AI busts open black boxes",
    "link": "https://carney.brown.edu/news/2024-10-31/explainable-ai",
    "blurb": "The Carney Institute for Brain Science is home to one of the foremost explainability research groups in the world, led by Thomas Serre. The team develops tools to understand and interpret deep learning models, making AI decision-making transparent.",
    "image": "https://scx1.b-cdn.net/csz/news/800a/2023/new-tool-explains-how.jpg"
  },
  {
    "title": "New tool explains how AI 'sees' images and why it might mistake an astronaut for a shovel",
    "link": "https://www.brown.edu/news/2023-06-28/computer-vision",
    "blurb": "Brown brain and computer scientists developed CRAFT (Concept Recursive Activation FacTorization for Explainability), a tool that identifies what concepts AI systems use and how they rank them. The project was presented at CVPR 2023 and explains classic AI mistakes.",
    "image": "https://scx1.b-cdn.net/csz/news/800a/2023/new-tool-explains-how.jpg"
  },
  {
    "title": "Compositionally in Neural Networks",
    "blurb": "PhD student Michael Lepori discusses new approaches to studying compositionality in neural network models in a recent Carney Community Spotlight.",
    "link": "https://www.brown.edu/carney/spotlights/michael-lepori",
    "image": "/images/scicomm/light_background_serre_cropped.jpeg"
  },
  {
    "title": "Finding the art in artificial intelligence",
    "blurb": "When design and neural networks mix the results are both practical and innovative.",
    "link": "https://www.brown.edu/carney/news/2019/05/20/finding-art-artificial-intelligence",
    "image": "/images/scicomm/RISD_Brown.jpg"
  },
  {
    "title": "Brown researchers teach computers to see optical illusions",
    "blurb": "By making a neural-network computer model that can be fooled by optical illusions like humans, the researchers advanced knowledge of the human visual system and may help improve artificial vision.",
    "link": "https://news.brown.edu/articles/2018/09/illusions",
    "image": "/images/scicomm/Illusions.jpg"
  },
  {
    "title": "Research identifies key weakness in modern computer vision systems",
    "blurb": "In a finding that could point the way toward better computer vision systems, Brown University researchers show why computers are so bad at seeing when one thing is not like another.",
    "link": "https://news.brown.edu/articles/2018/07/same-different",
    "image": "/images/scicomm/samedifferent.jpg"
  },
  {
    "title": "Focus on early stage of illness may be key to treating ALS, study suggests",
    "blurb": "Many inhibitory neurons were lost early in the development of ALS, new research shows, which is in sharp contrast to other degenerative diseases.",
    "link": "https://news.brown.edu/articles/2018/03/als",
    "image": "/images/scicomm/als.jpg"
  },
  {
    "title": "University conference explores future of artificial intelligence",
    "blurb": "Interdisciplinary workshop brings together professors, students from diverse academic fields",
    "link": "http://www.browndailyherald.com/2018/01/26/u-conference-explores-future-artificial-intelligence/",
    "image": "/images/scicomm/AI-conference.jpg"
  },
  {
    "title": "Researchers gather at Brown to discuss next-generation artificial intelligence",
    "blurb": "Technology known as deep learning has fueled an AI revolution, but a workshop series kicking off at Brown this week will consider where the field might go from here. Article by Kevin Stacey.",
    "link": "https://news.brown.edu/articles/2018/01/deeplearning",
    "image": "/images/scicomm/deeplearning.jpg"
  },
  {
    "title": "TDP-43 Mouse Model Research Featured",
    "blurb": "Serre Lab's machine vision-based automated phenotyping method (ACBM) was used to detect and quantify the earliest phenotypes in TDP-43 knock-in mice, contributing to ALS research. Published in Nature Neuroscience 2018.",
    "link": "https://pubmed.ncbi.nlm.nih.gov/29556029/",
    "image": "/images/scicomm/mouse.png"
  },
  {
    "title": "Artificial intelligence helps scientists map behavior in the fruit fly brain",
    "blurb": "Can you imagine watching 20,000 videos, 16 minutes apiece, of fruit flies walking, grooming, and chasing mates? Fortunately, you don't have to, because scientists have designed a computer program that can do it faster. Aided by artificial intelligence, researchers have made 100 billion annotations of behavior from 400,000 flies to create a collection of maps linking fly mannerisms to their corresponding brain regions. Article by Ryan Cross.",
    "link": "https://www.sciencemag.org/news/2017/07/artificial-intelligence-helps-scientists-map-behavior-fruit-fly-brain",
    "image": "/images/scicomm/fly-behavior.jpg"
  },
  {
    "title": "Meeting of the minds leads to brain science technology venture",
    "blurb": "Article by David Orenstein.",
    "link": "https://news.brown.edu/articles/2016/07/observation",
    "image": "/images/scicomm/neurocurious.jpg"
  },
  {
    "title": "A computer with a great eye is about to transform botany",
    "blurb": "Article by Margaret Rhodes",
    "link": "http://www.wired.com/2016/03/computer-great-eye-transform-botany/?mbid=social_fb",
    "image": "/images/scicomm/wired.png"
  },
  {
    "title": "Computer vision can help classify leaves",
    "blurb": "So complex are patterns and variations in the vein structures of leaves that botanists struggle to take advantage of them when trying to classify a specimen within the plant kingdom. A new study shows that computer vision technology can provide automated assistance by 'learning' how to use venation to assign leaves to their proper family and order. Article by David Orenstein.",
    "link": "https://news.brown.edu/articles/2016/03/leaves",
    "image": "/images/scicomm/leaves.jpg"
  },
  {
    "title": "Linking two labs a learning opportunity for Ph.D. student",
    "blurb": "Aaron Held's research merges and draws on the expertise of two of the labs in Brown's broad effort to combat ALS. That role has given him several opportunities to learn novel skills and new science during graduate school. Article by David Orenstein.",
    "link": "https://news.brown.edu/articles/2016/01/alsbar",
    "image": "/images/scicomm/alsbar.jpg"
  },
  {
    "title": "In analyzing a scene, we make the easiest judgments first",
    "blurb": "Article by David Orenstein.",
    "link": "https://news.brown.edu/articles/2015/09/scene",
    "image": "/images/scicomm/scene.jpg"
  },
  {
    "title": "Reducing Myc gene activity extends healthy lifespan in mice",
    "blurb": "Mice with one rather than the normal two copies of the gene Myc (also found in humans) lived 15 percent longer and had considerably healthier lives than normal mice, according to a new Brown University-led study in Cell. Article by David Orenstein.",
    "link": "https://news.brown.edu/articles/2015/01/myc",
    "image": "/images/scicomm/myc.jpg"
  },
  {
    "title": "Computer based video in behavioral studies",
    "blurb": "Computer-based video analysis boosts data gathering in behavioral studies. Article by David Orenstein",
    "link": "http://news.brown.edu/pressreleases/2010/09/mice",
    "image": "/images/scicomm/brown.png"
  },
  {
    "title": "Reverse engineering the brain",
    "blurb": "Cover story by Roberta Friedman featuring work from researchers including Thomas Serre on understanding and modeling the brain's computational mechanisms.",
    "link": "https://modha.org/2009/04/biomedical-computation-review-reverse-engineering-the-brain/",
    "image": "/images/scicomm/bc_review.png"
  },
  {
    "title": "Future watch: understanding the brain",
    "blurb": "Article by Logan Kugler",
    "link": "http://www.pcmag.com/article2/0,2817,2325885,00.asp",
    "image": "/images/scicomm/pc_mag.png"
  },
  {
    "title": "Visions of the Future - BBC Documentary",
    "blurb": "Serre Lab's work was featured in the BBC series 'Visions of the Future' with Dr. Michio Kaku, exploring the future of artificial intelligence and brain-inspired computing.",
    "link": "https://en.wikipedia.org/wiki/Visions_of_the_Future",
    "image": "/images/scicomm/visions.png"
  },
  {
    "title": "Computer vision inspired by the human brain",
    "blurb": "Article by Pam Frost Gorder",
    "link": "http://www.scientificamerican.com/article.cfm?id=visionary-research",
    "image": "/images/scicomm/computing_now.png"
  }
]
